Core/src/InformationRegisters/AzRyНапоминанияПользователя/AzRyНапоминанияПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AzRyНапоминанияПользователя</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособУстановкиВремениНапоминания</name>
    <type>
      <types>EnumRef.СпособыУстановкиВремениНапоминания</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалВремениНапоминания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРеквизитаИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВерсияДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеИсточника</name>
    <comment>Представление источника</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СтатусНапоминания</name>
    <type>
      <types>EnumRef.AzRyСтатусНапоминания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/AzRyСтатусНапоминания/AzRyСтатусНапоминания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AzRyСтатусНапоминания</name>
  <enumValues>
    <name>ОжидаетПодтверждения</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеОдобрено</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеНеОдобрено</name>
  </enumValues>
  <enumValues>
    <name>Finnished</name>
  </enumValues>
</mdclass:Enum>

Core/src/CommonModules/Az_Deprecated_AzRyFunctions/Module.bsl
Процедура ПодпискаНаСобытиеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	СтруктураВременныеТаблицы = Источник.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	Если СтруктураВременныеТаблицы.Свойство("AzRy_НапПольз_ДвиженияЗапасыНаСкладахИзменение") И СтруктураВременныеТаблицы.AzRy_НапПольз_ДвиженияЗапасыНаСкладахИзменение Тогда
		
		Текст1 = "საწყობის პასუხისმგებლის კონტროლი: დოკუმენტის (გატარება/მოხსნა) საწყობის პასუხისმგებლის გარეშე  დაბლოკილია. საწყობის პასუხისმგებელი პირი - '";
		Текст2 = "საწყობის პასუხისმგებლის კონტროლი: დოკუმენტის  (გატარება/მოხსნა) უნდა მოახდინოს შეტყობინების მიმღებმა. შეტყობინების მიმღები პირი  - '";
		
		Для каждого ТекущийОтветственный Из СтруктураВременныеТаблицы.AzRy_НапПольз_МассивТекущийОтветственный Цикл
			
			Если ТекущийОтветственный = Пользователи.ТекущийПользователь() Тогда // თუ საწყობის პასუხისმგებელი პირი ატარებს დოკუმენტს შემოწმება საჭირო აღარ არის.
				
				Продолжить;
						
			ИначеЕсли СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Неопределено 
				Или СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.ОжидаетПодтверждения
				Или СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.ПодтверждениеНеОдобрено
				Или СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.Finnished Тогда
				
				Отказ = Истина;
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Источник, Текст1 + ТекущийОтветственный + "' ",,,, Истина);
				
			ИначеЕсли СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) <> Неопределено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.ПодтверждениеОдобрено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель <> Пользователи.ТекущийПользователь() Тогда				

				Отказ = Истина;
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Источник, Текст2 + СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель + "' ",,,, Истина);
				
			ИначеЕсли СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) <> Неопределено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель <> Пользователи.ТекущийПользователь() Тогда				

				Отказ = Истина;
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Источник, Текст2 + СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель + "' ",,,, Истина);				
				
			ИначеЕсли СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) <> Неопределено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.ПодтверждениеОдобрено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель = Пользователи.ТекущийПользователь() Тогда

				СтатусНапоминания = СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный);
				РегистрыСведений.AzRyНапоминанияПользователя.ОбновитьЗаписьПослеПроведенияДокумента(СтатусНапоминания, Источник.Ссылка); 

			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//СтруктураВременныеТаблицы = Источник.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;	
	//Если Не СтруктураВременныеТаблицы.Свойство("AzRyДвиженияЗапасыИзменение") Или Отказ Или Не СтруктураВременныеТаблицы.AzRyДвиженияЗапасыИзменение Или СтруктураВременныеТаблицы.AzRyАвторДокумента = СтруктураВременныеТаблицы.AzRyОтветственныйЗаСклад Тогда
	//	Возврат;	
	//КонецЕсли; 
	//
	//// ვიძახებთ დამუშავებას და ვაგზავნით მეილს	                     
	//ОтправитьПисьмоОтветственногоЗаСкладом(СтруктураВременныеТаблицы.AzRyРегистратор, Пользователи.ТекущийПользователь());
	
КонецПроцедуры
